// Напишите программу, которая на вход принимает число и выдает его квадрат

Console.Write("Enter number: ");
int number = Convert.ToInt32(Console.ReadLine());
int sqr = number*number;
Console.WriteLine($"Square of the number {number} = {sqr}");

